{
  "add_cross_attention": false,
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ADDRESS",
    "2": "I-ADDRESS",
    "3": "B-NAME",
    "4": "I-NAME",
    "5": "B-PASSWORD",
    "6": "I-PASSWORD",
    "7": "B-API_KEY",
    "8": "I-API_KEY",
    "9": "B-CONTRACT_NAME",
    "10": "I-CONTRACT_NAME",
    "11": "B-PROPOSAL_NAME",
    "12": "I-PROPOSAL_NAME",
    "13": "B-DOC_FILE",
    "14": "I-DOC_FILE",
    "15": "B-PROJECT_NAME",
    "16": "I-PROJECT_NAME",
    "17": "B-FINANCIAL_NUM",
    "18": "I-FINANCIAL_NUM",
    "19": "B-PERSON",
    "20": "I-PERSON",
    "21": "B-ORG_NAME",
    "22": "I-ORG_NAME"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-ADDRESS": 1,
    "B-API_KEY": 7,
    "B-CONTRACT_NAME": 9,
    "B-DOC_FILE": 13,
    "B-FINANCIAL_NUM": 17,
    "B-NAME": 3,
    "B-ORG_NAME": 21,
    "B-PASSWORD": 5,
    "B-PERSON": 19,
    "B-PROJECT_NAME": 15,
    "B-PROPOSAL_NAME": 11,
    "I-ADDRESS": 2,
    "I-API_KEY": 8,
    "I-CONTRACT_NAME": 10,
    "I-DOC_FILE": 14,
    "I-FINANCIAL_NUM": 18,
    "I-NAME": 4,
    "I-ORG_NAME": 22,
    "I-PASSWORD": 6,
    "I-PERSON": 20,
    "I-PROJECT_NAME": 16,
    "I-PROPOSAL_NAME": 12,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
