{
  "_name_or_path": "monologg/koelectra-base-v3-discriminator",
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ADDRESS",
    "2": "I-ADDRESS",
    "3": "B-API_KEY",
    "4": "I-API_KEY",
    "5": "B-DOCUMENT",
    "6": "I-DOCUMENT",
    "7": "B-FINANCIAL",
    "8": "I-FINANCIAL",
    "9": "B-ORG",
    "10": "I-ORG",
    "11": "B-PASSWORD",
    "12": "I-PASSWORD",
    "13": "B-PERSON",
    "14": "I-PERSON",
    "15": "B-PROJECT",
    "16": "I-PROJECT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ADDRESS": 1,
    "B-API_KEY": 3,
    "B-DOCUMENT": 5,
    "B-FINANCIAL": 7,
    "B-ORG": 9,
    "B-PASSWORD": 11,
    "B-PERSON": 13,
    "B-PROJECT": 15,
    "I-ADDRESS": 2,
    "I-API_KEY": 4,
    "I-DOCUMENT": 6,
    "I-FINANCIAL": 8,
    "I-ORG": 10,
    "I-PASSWORD": 12,
    "I-PERSON": 14,
    "I-PROJECT": 16,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
